---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.EndTreatmentType
source: html/05046e84-8320-2054-09c8-8a06f368f1be.htm
---
# EndTreatmentType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.